avr-rust/avrd/packs/atmega/AT90PWM161.atdf
      <value-group caption="" name="ENUM_BOOTSZ">
        <value caption="Boot Flash size=128 words Boot address=$0F80" name="128W_0F80" value="0x03"/>
        <value caption="Boot Flash size=256 words Boot address=$0F00" name="256W_0F00" value="0x02"/>
        <value caption="Boot Flash size=512 words Boot address=$0E00" name="512W_0E00" value="0x01"/>
        <value caption="Boot Flash size=1024 words Boot address=$0C00" name="1024W_0C00" value="0x00"/>
      </value-group>
      <value-group caption="" name="ENUM_BODLEVEL">
        <value caption="Brown-out detection disabled" name="DISABLED" value="0x07"/>
        <value caption="Brown-out detection at VCC=1.8 V" name="1V8" value="0x06"/>
        <value caption="Brown-out detection at VCC=2.7 V" name="2V7" value="0x05"/>
        <value caption="Brown-out detection at VCC=4.3 V" name="4V3" value="0x04"/>
        <value caption="Brown-out detection at VCC=2.3 V" name="2V3" value="0x03"/>
        <value caption="Brown-out detection at VCC=2.2 V" name="2V2" value="0x02"/>
        <value caption="Brown-out detection at VCC=1.9 V" name="1V9" value="0x01"/>
        <value caption="Brown-out detection at VCC=2.0 V" name="2V0" value="0x00"/>
      </value-group>
    </module>
    <module caption="Lockbits" name="LOCKBIT">
      <register-group caption="Lockbits" name="LOCKBIT">
        <register caption="" name="LOCKBIT" offset="0x00" size="1">
          <bitfield caption="Memory Lock" mask="0x03" name="LB" values="ENUM_LB"/>
          <bitfield caption="Boot Loader Protection Mode" mask="0x0C" name="BLB0" values="ENUM_BLB"/>
          <bitfield caption="Boot Loader Protection Mode" mask="0x30" name="BLB1" values="ENUM_BLB2"/>
        </register>
      </register-group>
      <value-group caption="" name="ENUM_LB">
        <value caption="Further programming and verification disabled" name="PROG_VER_DISABLED" value="0x00"/>
        <value caption="Further programming disabled" name="PROG_DISABLED" value="0x02"/>
        <value caption="No memory lock features enabled" name="NO_LOCK" value="0x03"/>
      </value-group>
      <value-group caption="" name="ENUM_BLB">
        <value caption="LPM and SPM prohibited in Application Section" name="LPM_SPM_DISABLE" value="0x00"/>
        <value caption="LPM prohibited in Application Section" name="LPM_DISABLE" value="0x01"/>
        <value caption="SPM prohibited in Application Section" name="SPM_DISABLE" value="0x02"/>
        <value caption="No lock on SPM and LPM in Application Section" name="NO_LOCK" value="0x03"/>
      </value-group>
      <value-group caption="" name="ENUM_BLB2">
        <value caption="LPM and SPM prohibited in Boot Section" name="LPM_SPM_DISABLE" value="0x00"/>
        <value caption="LPM prohibited in Boot Section" name="LPM_DISABLE" value="0x01"/>
        <value caption="SPM prohibited in Boot Section" name="SPM_DISABLE" value="0x02"/>
        <value caption="No lock on SPM and LPM in Boot Section" name="NO_LOCK" value="0x03"/>
      </value-group>
    </module>
    <module caption="I/O Port" name="PORT">
      <register-group caption="I/O Port" name="PORTB">
        <register caption="Port B Data Register" name="PORTB" offset="0x25" size="1" mask="0xFF"/>
        <register caption="Port B Data Direction Register" name="DDRB" offset="0x24" size="1" mask="0xFF"/>
        <register caption="Port B Input Pins" name="PINB" offset="0x23" size="1" mask="0xFF" ocd-rw="R"/>
      </register-group>
      <register-group caption="I/O Port" name="PORTD">
        <register caption="Port D Data Register" name="PORTD" offset="0x2B" size="1" mask="0xFF"/>
        <register caption="Port D Data Direction Register" name="DDRD" offset="0x2A" size="1" mask="0xFF"/>
        <register caption="Port D Input Pins" name="PIND" offset="0x29" size="1" mask="0xFF" ocd-rw="R"/>
      </register-group>
      <register-group caption="I/O Port" name="PORTE">
        <register caption="Port E Data Register" name="PORTE" offset="0x2E" size="1" mask="0x07"/>
        <register caption="Port E Data Direction Register" name="DDRE" offset="0x2D" size="1" mask="0x07"/>
        <register caption="Port E Input Pins" name="PINE" offset="0x2C" size="1" mask="0x07" ocd-rw="R"/>
      </register-group>
    </module>
    <module caption="Digital-to-Analog Converter" name="DAC">
      <register-group caption="Digital-to-Analog Converter" name="DAC">
        <register caption="DAC Data Register High Byte" name="DACH" offset="0x59" size="1" ocd-rw="">
          <bitfield caption="DAC Data Register High Byte Bits" mask="0xFF" name="DACH"/>
        </register>
        <register caption="DAC Data Register Low Byte" name="DACL" offset="0x58" size="1" ocd-rw="">
          <bitfield caption="DAC Data Register Low Byte Bits" mask="0xFF" name="DACL"/>
        </register>
        <register caption="DAC Control Register" name="DACON" offset="0x76" size="1">
          <bitfield caption="DAC Auto Trigger Enable Bit" mask="0x80" name="DAATE"/>
          <bitfield caption="DAC Trigger Selection Bits" mask="0x70" name="DATS" values="ANALOG_DAC_AUTO_TRIGGER"/>
          <bitfield caption="DAC Left Adjust" mask="0x04" name="DALA"/>
          <bitfield caption="DAC Enable Bit" mask="0x01" name="DAEN"/>
        </register>
      </register-group>
      <value-group caption="" name="ANALOG_DAC_AUTO_TRIGGER">
        <value caption="Analog Comparator 0" name="VAL_0x00" value="0x00"/>
        <value caption="Analog Comparator 1" name="VAL_0x01" value="0x01"/>
        <value caption="External Interrupt Request 0" name="VAL_0x02" value="0x02"/>
        <value caption="Timer/Counter0 Compare Match A" name="VAL_0x03" value="0x03"/>
        <value caption="Timer/Counter0 Overflow" name="VAL_0x04" value="0x04"/>
        <value caption="Timer/Counter1 Compare Match B" name="VAL_0x05" value="0x05"/>
        <value caption="Timer/Counter1 Overflow" name="VAL_0x06" value="0x06"/>
        <value caption="Timer/Counter1 Capture Event" name="VAL_0x07" value="0x07"/>
      </value-group>
    </module>
