avr-rust/avrd/packs/atmega/AT90PWM161.atdf
        <register caption="ADC Data Register  Bytes" name="ADC" offset="0x4C" size="2" mask="0xFFFF"/>
        <register caption="ADC Control and Status Register B" name="ADCSRB" offset="0x27" size="1">
          <bitfield caption="ADC High Speed Mode" mask="0x80" name="ADHSM"/>
          <bitfield caption="ADC Noise Canceller Disable" mask="0x40" name="ADNCDIS"/>
          <bitfield caption="ADC Single Shot Enable on PSC's Synchronisation Signals" mask="0x10" name="ADSSEN"/>
          <bitfield caption="ADC Auto Trigger Sources" mask="0x0F" name="ADTS" values="ANALOG_ADC_AUTO_TRIGGER_4BITS"/>
        </register>
        <register caption="Digital Input Disable Register 0" name="DIDR0" offset="0x77" size="1">
          <bitfield caption="" mask="0x80" name="ADC7D"/>
          <bitfield caption="ADC7 Digital input Disable" mask="0x40" name="ADC6D"/>
          <bitfield caption="ADC5 Digital input Disable" mask="0x20" name="ADC5D"/>
          <bitfield caption="ADC4 Digital input Disable" mask="0x10" name="ADC4D"/>
          <bitfield caption="ADC3 Digital input Disable" mask="0x08" name="ADC3D"/>
          <bitfield caption="ADC2 Digital input Disable" mask="0x04" name="ADC2D"/>
          <bitfield caption="ADC1 Digital input Disable" mask="0x02" name="ADC1D"/>
          <bitfield caption="ADC0 Digital input Disable" mask="0x01" name="ADC0D"/>
        </register>
        <register caption="Digital Input Disable Register 0" name="DIDR1" offset="0x78" size="1">
          <bitfield caption="" mask="0x08" name="ACMP1MD"/>
          <bitfield caption="" mask="0x04" name="AMP0POSD"/>
          <bitfield caption="" mask="0x02" name="ADC10D"/>
          <bitfield caption="" mask="0x01" name="ADC9D"/>
        </register>
        <register caption="" name="AMP0CSR" offset="0x79" size="1">
          <bitfield caption="" mask="0x80" name="AMP0EN"/>
          <bitfield caption="" mask="0x40" name="AMP0IS"/>
          <bitfield caption="" mask="0x30" name="AMP0G"/>
          <bitfield caption="" mask="0x08" name="AMP0GS"/>
          <bitfield caption="" mask="0x03" name="AMP0TS"/>
        </register>
      </register-group>
      <value-group caption="" name="ANALOG_ADC_V_REF2">
        <value caption="AREF, Internal Vref turned off" name="VAL_0x00" value="0x00"/>
        <value caption="AVCC with external capacitor at AREF pin" name="VAL_0x01" value="0x01"/>
        <value caption="Reserved" name="VAL_0x02" value="0x02"/>
        <value caption="Internal 2.56V Voltage Reference with external capacitor at AREF pin" name="VAL_0x03" value="0x03"/>
      </value-group>
      <value-group caption="" name="ANALOG_ADC_AUTO_TRIGGER_4BITS">
        <value caption="Free Running mode" name="VAL_0x00" value="0x00"/>
        <value caption="Analog Comparator" name="VAL_0x01" value="0x01"/>
        <value caption="External Interrupt Request 0" name="VAL_0x02" value="0x02"/>
        <value caption="Timer/Counter0 Compare Match A" name="VAL_0x03" value="0x03"/>
        <value caption="Timer/Counter0 Overflow" name="VAL_0x04" value="0x04"/>
        <value caption="Timer/Counter1 Compare Match B" name="VAL_0x05" value="0x05"/>
        <value caption="Timer/Counter1 Overflow" name="VAL_0x06" value="0x06"/>
        <value caption="Timer/Counter1 Capture Event" name="VAL_0x07" value="0x07"/>
        <value caption="PSC0ASY Event" name="VAL_0x08" value="0x08"/>
        <value caption="PSC1ASY Event" name="VAL_0x09" value="0x09"/>
        <value caption="PSC2ASY Event" name="VAL_0x0A" value="0x0A"/>
        <value caption="Analog comparator 1" name="VAL_0x0B" value="0x0B"/>
        <value caption="Analog comparator 2" name="VAL_0x0C" value="0x0C"/>
      </value-group>
    </module>
    <module caption="Analog Comparator" name="AC">
      <register-group caption="Analog Comparator" name="AC">
        <register caption="Analog Comparator3 Control Register" name="AC3CON" offset="0x7F" size="1">
          <bitfield caption="Analog Comparator3 Enable Bit" mask="0x80" name="AC3EN"/>
          <bitfield caption="Analog Comparator 3 Interrupt Enable Bit" mask="0x40" name="AC3IE"/>
          <bitfield caption="Analog Comparator 3  Interrupt Select Bit" mask="0x30" name="AC3IS"/>
          <bitfield caption="Analog Comparator 3 Alternate Output Enable" mask="0x08" name="AC3OEA"/>
          <bitfield caption="Analog Comparator 3 Multiplexer Register" mask="0x07" name="AC3M"/>
        </register>
        <register caption="Analog Comparator 1 Control Register" name="AC1CON" offset="0x7D" size="1">
          <bitfield caption="Analog Comparator 1 Enable Bit" mask="0x80" name="AC1EN"/>
          <bitfield caption="Analog Comparator 1 Interrupt Enable Bit" mask="0x40" name="AC1IE"/>
          <bitfield caption="Analog Comparator 1  Interrupt Select Bit" mask="0x30" name="AC1IS" values="ANALOG_COMP_INTERRUPT"/>
          <bitfield caption="Analog Comparator 1 Multiplexer Register" mask="0x07" name="AC1M"/>
        </register>
        <register caption="Analog Comparator 2 Control Register" name="AC2CON" offset="0x7E" size="1">
          <bitfield caption="Analog Comparator 2 Enable Bit" mask="0x80" name="AC2EN"/>
          <bitfield caption="Analog Comparator 2 Interrupt Enable Bit" mask="0x40" name="AC2IE"/>
          <bitfield caption="Analog Comparator 2  Interrupt Select Bit" mask="0x30" name="AC2IS" values="ANALOG_COMP_INTERRUPT"/>
          <bitfield caption="Analog Comparator 2 Multiplexer Register" mask="0x07" name="AC2M"/>
        </register>
        <register caption="Analog Comparator Status Register" name="ACSR" offset="0x20" size="1" ocd-rw="R">
          <bitfield caption="Analog Comparator 3 Interrupt Flag Bit" mask="0x80" name="AC3IF"/>
          <bitfield caption="Analog Comparator 2 Interrupt Flag Bit" mask="0x40" name="AC2IF"/>
          <bitfield caption="Analog Comparator 1  Interrupt Flag Bit" mask="0x20" name="AC1IF"/>
          <bitfield caption="Analog Comparator 3 Output Bit" mask="0x08" name="AC3O"/>
          <bitfield caption="Analog Comparator 2 Output Bit" mask="0x04" name="AC2O"/>
          <bitfield caption="Analog Comparator 1 Output Bit" mask="0x02" name="AC1O"/>
        </register>
        <register caption="" name="AC3ECON" offset="0x7C" size="1">
          <bitfield caption="Analog Comparator Ouput Invert" mask="0x20" name="AC3OI"/>
          <bitfield caption="Analog Comparator Ouput Enable" mask="0x10" name="AC3OE"/>
          <bitfield caption="Analog Comparator Hysteresis Select" mask="0x07" name="AC3H"/>
        </register>
