avr-rust/avrd/packs/atmega/AT90PWM161.atdf
        <register caption="" name="AC2ECON" offset="0x7B" size="1">
          <bitfield caption="Analog Comparator Ouput Invert" mask="0x20" name="AC2OI"/>
          <bitfield caption="Analog Comparator Ouput Enable" mask="0x10" name="AC2OE"/>
          <bitfield caption="Analog Comparator Hysteresis Select" mask="0x07" name="AC2H"/>
        </register>
        <register caption="" name="AC1ECON" offset="0x7A" size="1">
          <bitfield caption="Analog Comparator Ouput Invert" mask="0x20" name="AC1OI"/>
          <bitfield caption="Analog Comparator Ouput Enable" mask="0x10" name="AC1OE"/>
          <bitfield caption="Analog Comparator Interrupt Capture Enable" mask="0x08" name="AC1ICE"/>
          <bitfield caption="Analog Comparator Hysteresis Select" mask="0x07" name="AC1H"/>
        </register>
      </register-group>
      <value-group caption="" name="ANALOG_COMP_INTERRUPT">
        <value caption="Interrupt on Toggle" name="VAL_0x00" value="0x00"/>
        <value caption="Reserved" name="VAL_0x01" value="0x01"/>
        <value caption="Interrupt on Falling Edge" name="VAL_0x02" value="0x02"/>
        <value caption="Interrupt on Rising Edge" name="VAL_0x03" value="0x03"/>
      </value-group>
    </module>
    <module caption="CPU Registers" name="CPU">
      <register-group caption="CPU Registers" name="CPU">
        <register caption="Status Register" name="SREG" offset="0x5F" size="1">
          <bitfield caption="Global Interrupt Enable" mask="0x80" name="I"/>
          <bitfield caption="Bit Copy Storage" mask="0x40" name="T"/>
          <bitfield caption="Half Carry Flag" mask="0x20" name="H"/>
          <bitfield caption="Sign Bit" mask="0x10" name="S"/>
          <bitfield caption="Two's Complement Overflow Flag" mask="0x08" name="V"/>
          <bitfield caption="Negative Flag" mask="0x04" name="N"/>
          <bitfield caption="Zero Flag" mask="0x02" name="Z"/>
          <bitfield caption="Carry Flag" mask="0x01" name="C"/>
        </register>
        <register caption="Stack Pointer " name="SP" offset="0x5D" size="2" mask="0xFFFF"/>
        <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
          <bitfield caption="Pull-up disable" mask="0x10" name="PUD"/>
          <bitfield caption="Reset Pin Disable" mask="0x08" name="RSTDIS"/>
          <bitfield caption="Frequency Selection of the Calibrated RC Oscillator" mask="0x04" name="CKRC81"/>
          <bitfield caption="Interrupt Vector Select" mask="0x02" name="IVSEL"/>
          <bitfield caption="Interrupt Vector Change Enable" mask="0x01" name="IVCE"/>
        </register>
        <register caption="MCU Status Register" name="MCUSR" offset="0x54" size="1">
          <bitfield caption="Watchdog Reset Flag" mask="0x08" name="WDRF"/>
          <bitfield caption="Brown-out Reset Flag" mask="0x04" name="BORF"/>
          <bitfield caption="External Reset Flag" mask="0x02" name="EXTRF"/>
          <bitfield caption="Power-on reset flag" mask="0x01" name="PORF"/>
        </register>
        <register caption="Oscillator Calibration Value" name="OSCCAL" offset="0x88" size="1" mask="0xFF" ocd-rw="R">
          <bitfield caption="Oscillator Calibration " mask="0xFF" name="OSCCAL"/>
        </register>
        <register caption="" name="CLKPR" offset="0x83" size="1" ocd-rw="R">
          <bitfield caption="" mask="0x80" name="CLKPCE"/>
          <bitfield caption="" mask="0x0F" name="CLKPS" values="CPU_CLK_PRESCALE_4_BITS_SMALL"/>
        </register>
        <register caption="Sleep Mode Control Register" name="SMCR" offset="0x53" size="1">
          <bitfield caption="Sleep Mode Select bits" mask="0x0E" name="SM" values="CPU_SLEEP_MODE_3BITS4"/>
          <bitfield caption="Sleep Enable" mask="0x01" name="SE"/>
        </register>
        <register caption="General Purpose IO Register 2" name="GPIOR2" offset="0x3B" size="1">
          <bitfield caption="General Purpose IO Register 2 bis" mask="0xFF" name="GPIOR" lsb="20"/>
        </register>
        <register caption="General Purpose IO Register 1" name="GPIOR1" offset="0x3A" size="1">
          <bitfield caption="General Purpose IO Register 1 bis" mask="0xFF" name="GPIOR" lsb="10"/>
        </register>
        <register caption="General Purpose IO Register 0" name="GPIOR0" offset="0x39" size="1">
          <bitfield caption="General Purpose IO Register 0 bit 7" mask="0x80" name="GPIOR07"/>
          <bitfield caption="General Purpose IO Register 0 bit 6" mask="0x40" name="GPIOR06"/>
          <bitfield caption="General Purpose IO Register 0 bit 5" mask="0x20" name="GPIOR05"/>
          <bitfield caption="General Purpose IO Register 0 bit 4" mask="0x10" name="GPIOR04"/>
          <bitfield caption="General Purpose IO Register 0 bit 3" mask="0x08" name="GPIOR03"/>
          <bitfield caption="General Purpose IO Register 0 bit 2" mask="0x04" name="GPIOR02"/>
          <bitfield caption="General Purpose IO Register 0 bit 1" mask="0x02" name="GPIOR01"/>
          <bitfield caption="General Purpose IO Register 0 bit 0" mask="0x01" name="GPIOR00"/>
        </register>
        <register caption="PLL Control And Status Register" name="PLLCSR" offset="0x87" size="1">
          <bitfield caption="" mask="0x3C" name="PLLF"/>
          <bitfield caption="PLL Enable" mask="0x02" name="PLLE"/>
          <bitfield caption="PLL Lock Detector" mask="0x01" name="PLOCK"/>
        </register>
        <register caption="Power Reduction Register" name="PRR" offset="0x86" size="1">
          <bitfield caption="Power Reduction PSC2" mask="0x80" name="PRPSC2"/>
          <bitfield caption="Power Reduction PSC0" mask="0x20" name="PRPSCR"/>
          <bitfield caption="Power Reduction Timer/Counter1" mask="0x10" name="PRTIM1"/>
          <bitfield caption="Power Reduction Serial Peripheral Interface" mask="0x04" name="PRSPI"/>
          <bitfield caption="Power Reduction ADC" mask="0x01" name="PRADC"/>
        </register>
        <register caption="" name="CLKCSR" offset="0x84" size="1">
          <bitfield caption="Clock Control Change Enable" mask="0x80" name="CLKCCE"/>
          <bitfield caption="Clock Ready Flag" mask="0x10" name="CLKRDY"/>
          <bitfield caption="Clock Control" mask="0x0F" name="CLKC"/>
        </register>
        <register caption="" name="CLKSELR" offset="0x85" size="1">
          <bitfield caption="Clock OUT" mask="0x40" name="COUT"/>
          <bitfield caption="Clock Start up Time" mask="0x30" name="CSUT"/>
          <bitfield caption="Clock Source Select" mask="0x0F" name="CKSEL"/>
        </register>
        <register caption="BandGap Current Calibration Register" name="BGCCR" offset="0x81" size="1">
          <bitfield caption="" mask="0x0F" name="BGCC"/>
        </register>
        <register caption="BandGap Resistor Calibration Register" name="BGCRR" offset="0x80" size="1">
          <bitfield caption="" mask="0x0F" name="BGCR"/>
        </register>
      </register-group>
